/* No comment provided by engineer. */
"%@ to %@" = "%1$@ đến %2$@";

/* No comment provided by engineer. */
"%d of %d" = "%1$d trên %2$d";

/* No comment provided by engineer. */
"%li to %li" = "%1$li đến %2$li";

/* No comment provided by engineer. */
"'item' parameter required" = "yêu cầu tham số 'mục'";

/* No comment provided by engineer. */
"'portal' parameter required" = "yêu cầu tham số 'cổng thông tin'";

/* No comment provided by engineer. */
"'tags' parameter required" = "yêu cầu tham số 'thẻ'";

/* No comment provided by engineer. */
"'title' parameter required" = "yêu cầu tham số 'tiêu đề'";

/* No comment provided by engineer. */
"+/-" = "-";

/* No comment provided by engineer. */
"<No value>" = "<không có giá trị>";

/* No comment provided by engineer. */
"Access to the device location is denied." = "Việc truy cập vào vị trí của thiết bị bị từ chối";

/* No comment provided by engineer. */
"Actual Size" = "Kích cỡ thực tế";

/* No comment provided by engineer. */
"Add" = "Thêm";

/* No comment provided by engineer. */
"Add Attachment" = "Thêm Tệp đính kèm";

/* No comment provided by engineer. */
"Add..." = "Thêm...";

/* No comment provided by engineer. */
"An itemID is required for this operation. Add this item to the Portal to get an ItemID." = "Yêu cầu ID mục cho thao tác này. Thêm mục này vào Cổng thông tin để lấy ID mục.";

/* No comment provided by engineer. */
"An uncaught NSException was detected, however the original information and callstack is not available. Break on objective-c exceptions to see the line of code causing the original NSException. For more information on how to do this please see the documentation." = "Đã phát hiện một NSException chưa bị giữ lại, tuy nhiên thông tin ban đầu và ngăn xếp lời gọi không khả dụng. Ngắt ngoại lệ mục tiêu-c để xem đường mã gây ra NSException ban đầu. Để biết thêm thông tin về cách xử lý tình huống này, vui lòng xem tài liệu.";

/* No comment provided by engineer. */
"Apply Geometry" = "Áp dụng Hình học";

/* No comment provided by engineer. */
"At least 1 facility is required to solve a route." = "Yêu cầu ít nhất 1 cơ sở để xử lý tuyến đường.";

/* No comment provided by engineer. */
"At least 1 incident is required to solve a route." = "Yêu cầu ít nhất 1 sự cố để xử lý tuyến đường.";

/* No comment provided by engineer. */
"At least 2 stops are required to solve a route." = "Yêu cầu ít nhất 2 điểm dừng để xử lý tuyến đường.";

/* No comment provided by engineer. */
"Attachment" = "Phần đính kèm";

/* No comment provided by engineer. */
"Attachments" = "Tệp đính kèm";

/* No comment provided by engineer. */
"Attempt to use functionality that is not supported for the current license level" = "Cố gắng sử dụng loại chức năng không được hỗ trợ với cấp độ giấy phép hiện tại.";

/* No comment provided by engineer. */
"Authorization required" = "Yêu cầu cấp phép";

/* No comment provided by engineer. */
"Bad Request" = "Yêu cầu không hợp lệ";

/* No comment provided by engineer. */
"Bad URL." = "URL hỏng.";

/* No comment provided by engineer. */
"bytes" = "byte";

/* No comment provided by engineer. */
"Cancel" = "Hủy";

/* No comment provided by engineer. */
"Cannot save to a different item type." = "Không thể lưu vào một loại mục khác.";

/* No comment provided by engineer. */
"Cannot verify the identity of '%@'" = "Không thể xác thực định danh của '%@'";

/* No comment provided by engineer. */
"Certificate Required" = "Yêu cầu chứng chỉ";

/* No comment provided by engineer. */
"Challenge for URL: %@ with failureCount: %lu" = "Challenge cho URL: %1$@ với failureCount: %2$lu";

/* No comment provided by engineer. */
"Changing Feature Type" = "Thay đổi Loại Đối tượng";

/* No comment provided by engineer. */
"Choose From Library" = "Chọn từ Thư viện";

/* No comment provided by engineer. */
"Clear" = "Xóa";

/* No comment provided by engineer. */
"Clear Geometry" = "Xóa Hình học";

/* No comment provided by engineer. */
"Continue" = "Tiếp";

/* No comment provided by engineer. */
"Created %d hours ago" = "Được tạo cách đây %d giờ";

/* No comment provided by engineer. */
"Created %d minutes ago" = "Được tạo cách đây %d phút";

/* No comment provided by engineer. */
"Created a minute ago" = "Được tạo một phút trước";

/* No comment provided by engineer. */
"Created an hour ago" = "Được tạo một giờ trước";

/* No comment provided by engineer. */
"Created by %@" = "Được tạo bởi %@";

/* No comment provided by engineer. */
"Created by %@ %d hours ago" = "Được tạo bởi %1$@ cách đây %2$d giờ";

/* No comment provided by engineer. */
"Created by %@ %d minutes ago" = "Được tạo bởi %1$@ cách đây %2$d phút";

/* No comment provided by engineer. */
"Created by %@ a minute ago" = "Được tạo bởi %@ cách đây một phút";

/* No comment provided by engineer. */
"Created by %@ an hour ago" = "Được tạo bởi %@ cách đây một giờ";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - day" = "Được tạo bởi %1$@ trên %2$@ tại %3$@ - ban ngày";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - full" = "Được tạo bởi %1$@ trên %2$@ tại %3$@ - cả ngày";

/* No comment provided by engineer. */
"Created by %@ seconds ago" = "Được tạo bởi %@ giây trước";

/* No comment provided by engineer. */
"Created on %@ at %@ - day" = "Được tạo trên %1$@ tại %2$@ - ban ngày";

/* No comment provided by engineer. */
"Created on %@ at %@ - full" = "Được tạo trên %1$@ tại %2$@ - cả ngày";

/* No comment provided by engineer. */
"Created seconds ago" = "Được tạo vài giây trước";

/* No comment provided by engineer. */
"Credential Required" = "Yêu cầu thông tin xác thực";

/* No comment provided by engineer. */
"Data for pie chart is invalid" = "Dữ liệu cho biểu đồ hình tròn không hợp lệ";

/* No comment provided by engineer. */
"Delete" = "Xóa";

/* No comment provided by engineer. */
"Delete Attachment" = "Xóa Tệp đính kèm";

/* No comment provided by engineer. */
"Delete Feature" = "Xóa Đối tượng";

/* No comment provided by engineer. */
"Deleting this attachment will remove it from the popup and associated data source." = "Việc xóa tệp đính kèm này sẽ loại bỏ nó khỏi cửa sổ popup và nguồn dữ liệu liên quan.";

/* No comment provided by engineer. */
"Deleting this feature will remove it from the map and associated data source." = "Việc xóa đối tượng này sẽ loại bỏ nó khỏi bản đồ và nguồn dữ liệu liên quan.";

/* No comment provided by engineer. */
"Directions time and distance attributes do not match." = "Các thuộc tính thời gian và khoảng cách chỉ đường không trùng khớp.";

/* No comment provided by engineer. */
"Edit" = "Chỉnh sửa";

/* No comment provided by engineer. */
"Edited %d hours ago" = "Được chỉnh sửa %d giờ trước";

/* No comment provided by engineer. */
"Edited %d minutes ago" = "Được chỉnh sửa cách đây %d phút";

/* No comment provided by engineer. */
"Edited a minute ago" = "Được sửa một phút trước";

/* No comment provided by engineer. */
"Edited an hour ago" = "Được sửa một giờ trước";

/* No comment provided by engineer. */
"Edited by %@" = "Được chỉnh sửa bởi %@";

/* No comment provided by engineer. */
"Edited by %@ %d hours ago" = "Được chỉnh sửa bởi %1$@ cách đây %2$d giờ";

/* No comment provided by engineer. */
"Edited by %@ %d minutes ago" = "Được chỉnh sửa bởi %1$@ cách đây %2$d phút";

/* No comment provided by engineer. */
"Edited by %@ a minute ago" = "Được chỉnh sửa bởi %@ cách đây một phút";

/* No comment provided by engineer. */
"Edited by %@ an hour ago" = "Được chỉnh sửa bởi %@ cách đây một giờ";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - day" = "Được chỉnh sửa bởi %1$@ trên %2$@ tại %3$@ - ban ngày";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - full" = "Được chỉnh sửa bởi %1$@ trên %2$@ tại %3$@ - cả ngày";

/* No comment provided by engineer. */
"Edited by %@ seconds ago" = "Được chỉnh sửa bởi %@ cách đây vài giây";

/* No comment provided by engineer. */
"Edited on %@ at %@ - day" = "Được chỉnh sửa trên %1$@ tại %2$@ - ban ngày";

/* No comment provided by engineer. */
"Edited on %@ at %@ - full" = "Được chỉnh sửa trên %1$@ tại %2$@ - cả ngày";

/* No comment provided by engineer. */
"Edited seconds ago" = "Được sửa vài giây trước";

/* No comment provided by engineer. */
"Empty username/password" = "Tên đăng nhập/mật khẩu để trống";

/* No comment provided by engineer. */
"Enter a date between %@ and %@" = "Nhập ngày trong khoảng từ %1$@ đến %2$@";

/* No comment provided by engineer. */
"Enter a number between %@ and %@" = "Nhập một số trong khoảng từ %1$@ đến %2$@";

/* No comment provided by engineer. */
"Enter a number between %i and %i" = "Nhập một số trong khoảng từ %1$i đến %2$i";

/* No comment provided by engineer. */
"Error" = "Lỗi";

/* No comment provided by engineer. */
"Error adding identity to the keychain" = "Lỗi thêm định danh vào chuỗi khóa";

/* No comment provided by engineer. */
"Error adding keychain item" = "Lỗi thêm mục chuỗi khóa";

/* No comment provided by engineer. */
"Error extracting identity" = "Lỗi trích xuất định danh";

/* No comment provided by engineer. */
"Error Loading Page" = "Lỗi Tải Trang";

/* No comment provided by engineer. */
"Error removing keychain item" = "Lỗi xóa mục chuỗi khóa";

/* No comment provided by engineer. */
"Error updating keychain item" = "Lỗi cập nhật mục chuỗi khóa";

/* No comment provided by engineer. */
"Exceeds maximum value (%@)" = "Vượt quá giá trị tối đa (%@)";

/* No comment provided by engineer. */
"Extra Large" = "Cực lớn";

/* No comment provided by engineer. */
"Facility (%1$@) has invalid added cost attribute names (%2$@)." = "Cơ sở (%1$@) có tên thuộc tính chi phí được thêm vào không hợp lệ (%2$@).";

/* No comment provided by engineer. */
"Facility (%1$@) has negative added cost attribute (%2$@)." = "Cơ sở (%1$@) có thuộc tính chi phí được thêm vào là số âm (%2$@).";

/* No comment provided by engineer. */
"Feature isn't valid." = "Đối tượng không hợp lệ.";

/* No comment provided by engineer. */
"Finish" = "Kết thúc";

/* No comment provided by engineer. */
"Finishing editing..." = "Đang hoàn tất chỉnh sửa...";

/* No comment provided by engineer. */
"GB" = "GB";

/* No comment provided by engineer. */
"Geometry" = "Hình học";

/* No comment provided by engineer. */
"Hide" = "Ẩn";

/* No comment provided by engineer. */
"Incident (%1$@) has invalid added cost attribute names (%2$@)." = "Sự cố (%1$@) có tên thuộc tính chi phí được thêm vào không hợp lệ (%2$@).";

/* No comment provided by engineer. */
"Incident (%1$@) has negative added cost attribute (%2$@)." = "Sự cố (%1$@) có thuộc tính chi phí được thêm vào là số âm (%2$@).";

/* No comment provided by engineer. */
"Insert Part" = "Chèn Phần";

/* No comment provided by engineer. */
"Insert Vertex" = "Chèn Đỉnh";

/* No comment provided by engineer. */
"Invalid argument." = "Đối số không hợp lệ.";

/* No comment provided by engineer. */
"Invalid Credentials" = "Thông tin xác thực không hợp lệ";

/* No comment provided by engineer. */
"Invalid GPX data." = "Dữ liệu GPX không hợp lệ.";

/* No comment provided by engineer. */
"Invalid groupID." = "ID nhóm không hợp lệ.";

/* No comment provided by engineer. */
"Joining this organization is supported by invitation only, you need to receive an invitation from the administrator" = "Việc tham gia vào tổ chức này chỉ được hỗ trợ bằng thư mời, bạn cần nhận được thư mời từ nhà quản trị";

/* No comment provided by engineer. */
"KB" = "KB";

/* No comment provided by engineer. */
"Keep Current Values" = "Giữ các Giá trị Hiện tại";

/* No comment provided by engineer. */
"Large" = "Lớn";

/* No comment provided by engineer. */
"Less than minimum value (%@)" = "Dưới giá trị tối thiểu (%@)";

/* No comment provided by engineer. */
"Licensed for Developer Use Only" = "Chỉ cấp phép cho nhà phát triển sử dụng";

/* No comment provided by engineer. */
"Loading feature..." = "Đang tải đối tượng...";

/* No comment provided by engineer. */
"Map contains data that cannot be saved. To save this map, which will remove this data, pass true for forceSaveToSupportedVersion." = "Bản đồ có dữ liệu không thể được lưu lại. Để lưu bản đồ với việc gỡ bỏ dữ liệu trên, chấp nhận việc bắt buộc lưu vào phiên bản được hỗ trợ.";

/* No comment provided by engineer. */
"MB" = "MB";

/* No comment provided by engineer. */
"Medium" = "Trung bình";

/* No comment provided by engineer. */
"Missing client certificate" = "Thiếu chứng chỉ máy khách";

/* string to represent hyperlink attributes */
"More Info" = "Thông tin Khác";

/* No comment provided by engineer. */
"Move Geometry" = "Di chuyển Hình học";

/* No comment provided by engineer. */
"Move Part" = "Di chuyển Bộ phận";

/* No comment provided by engineer. */
"Move Vertex" = "Di chuyển Đỉnh";

/* No comment provided by engineer. */
"No certificate found to access the resource '%@'" = "Không tìm thấy chứng chỉ nào để truy cập tài nguyên '%@'";

/* No comment provided by engineer. */
"No data to create a bar chart" = "Không có dữ liệu để tạo biểu đồ thanh";

/* No comment provided by engineer. */
"No data to create a line chart" = "Không có dữ liệu để tạo biểu đồ dạng đường";

/* No comment provided by engineer. */
"No data to create a pie chart" = "Không có dữ liệu để tạo biểu đồ hình tròn";

/* No comment provided by engineer. */
"No image to display" = "Không có hình ảnh để hiển thị";

/* No comment provided by engineer. */
"No path can be found between a given pair of stops (%@)." = "Không thể tìm thấy đường dẫn giữa các cặp điểm dừng cụ thể (%@).";

/* No comment provided by engineer. */
"Not a valid number" = "Không phải là số hợp lệ";

/* No comment provided by engineer. */
"Not a valid whole number" = "Không phải là số nguyên hợp lệ";

/* No comment provided by engineer. */
"Object cannot be created without a portal.  Use fromJSON:withPortal:error: method instead." = "Không thể tạo đối tượng mà không sử dụng cổng thông tin. Sử dụng phương pháp thay thế fromJSON:withPortal:error:.";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"One or more accumulate attribute names (%@) are invalid." = "Một hoặc nhiều tên thuộc tính tích lũy (%@) không hợp lệ.";

/* No comment provided by engineer. */
"One or more attribute names (%@) associated with the custom parameter attribute values are invalid." = "Một hoặc nhiều tên thuộc tính (%@) liên quan đến các giá trị thuộc tính thông số tùy chỉnh không hợp lệ.";

/* No comment provided by engineer. */
"One or more facilities (%@) have a null geometry." = "Một hoặc nhiều cơ sở (%@) có loại hình học rỗng.";

/* No comment provided by engineer. */
"One or more facilities (%@) have an invalid curb approach." = "Một hoặc nhiều cơ sở (%@) có lối đi gần lề đường không hợp lệ.";

/* No comment provided by engineer. */
"One or more facilities (%@) have invalid impedance cutoff." = "Một hoặc nhiều cơ sở (%@) có ngưỡng trở kháng không hợp lệ.";

/* No comment provided by engineer. */
"One or more incidents (%@) have a null geometry." = "Một hoặc nhiều sự cố (%@) có loại hình học rỗng.";

/* No comment provided by engineer. */
"One or more incidents (%@) have an invalid curb approach." = "Một hoặc nhiều sự cố (%@) có lối đi gần lề đường không hợp lệ.";

/* No comment provided by engineer. */
"One or more incidents (%@) have invalid impedance cutoff." = "Một hoặc nhiều sự cố (%@) có ngưỡng trở kháng không hợp lệ.";

/* No comment provided by engineer. */
"One or more incidents (%@) have less than 1 target facility count." = "Một hoặc nhiều sự cố (%@) có ít hơn 1 cơ sở mục tiêu.";

/* No comment provided by engineer. */
"One or more parameter names (%@) associated with the custom parameter attribute values are invalid." = "Một hoặc nhiều tên thông số (%@) liên quan đến các giá trị thuộc tính thông số tùy chỉnh không hợp lệ.";

/* No comment provided by engineer. */
"One or more parameter value types associated with the custom parameter attribute values (%@) are invalid." = "Một hoặc nhiều loại giá trị thông số liên quan đến các giá trị thuộc tính thông số tùy chỉnh (%@) không hợp lệ.";

/* No comment provided by engineer. */
"One or more point barriers (%@) are unlocated." = "Một hoặc nhiều barrier dạng điểm (%@) không được xác định vị trí.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have a null geometry." = "Một hoặc nhiều barrier dạng điểm (%@) có loại hình học rỗng.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid added cost attribute name." = "Một hoặc nhiều barrier dạng điểm (%@) có tên thuộc tính chi phí bổ sung không hợp lệ.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid curb approach." = "Một hoặc nhiều barrier dạng điểm (%@) có lối đi gần lề đường không hợp lệ.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) does not cover any network elements." = "Một hoặc nhiều barrier dạng vùng (%@) không bao gồm bất kỳ yếu tố mạng lưới nào.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have a null geometry." = "Một hoặc nhiều barrier dạng vùng (%@) có loại hình học rỗng.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have an invalid scaled cost attribute name." = "Một hoặc nhiều barrier dạng vùng (%@) có tên thuộc tính chi phí tỷ lệ không hợp lệ.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) does not cover any network elements." = "Một hoặc nhiều barrier dạng đường (%@) không bao gồm bất kỳ yếu tố mạng lưới nào.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have a null geometry." = "Một hoặc nhiều barrier dạng đường (%@) có loại hình học rỗng.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have an invalid scaled cost attribute name." = "Một hoặc nhiều barrier dạng đường (%@) có tên thuộc tính chi phí tỷ lệ không hợp lệ.";

/* No comment provided by engineer. */
"One or more restriction attribute names (%@) are invalid." = "Một hoặc nhiều tên thuộc tính giới hạn (%@) không hợp lệ.";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values (%2$@) are invalid." = "Một hoặc nhiều giá trị sử dụng giới hạn (%1$@) liên quan đến các giá trị thuộc tính thông số tùy chỉnh (%2$@) không hợp lệ.";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values ((%2$@) are neutral (i.e., have no effect)." = "Một hoặc nhiều giá trị sử dụng giới hạn (%1$@) liên quan đến các giá trị thuộc tính thông số tùy chỉnh ((%2$@) bằng không (nghĩa là không có ảnh hưởng).";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a non-traversable element." = "Một hoặc nhiều điểm dừng (%@) được định vị trên một yếu tố không thể đi qua.";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a soft-restricted element." = "Một hoặc nhiều điểm dừng (%@) được định vị trên một yếu tố có một số giới hạn.";

/* No comment provided by engineer. */
"One or more stops (%@) are unlocated." = "Một hoặc nhiều điểm dừng (%@) không được xác định vị trí.";

/* No comment provided by engineer. */
"One or more stops (%@) cannot be reached from other stops." = "Một hoặc nhiều điểm dừng (%@) không thể đi đến được từ các điểm dừng khác.";

/* No comment provided by engineer. */
"One or more stops (%@) have a null geometry." = "Một hoặc nhiều điểm dừng (%@) có loại hình học rỗng.";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window end that occurs before its time window start." = "Một hoặc nhiều điểm dừng (%@) có khung giờ kết thúc diễn ra trước khung giờ bắt đầu.";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window that starts before January 1, 1970." = "Một hoặc nhiều điểm dừng (%@) có khung giờ bắt đầu trước ngày 1 tháng 1 năm 1970.";

/* No comment provided by engineer. */
"One or more stops (%@) have an invalid curb approach." = "Một hoặc nhiều điểm dừng (%@) có lối đi gần lề đường không hợp lệ.";

/* No comment provided by engineer. */
"Open in Safari" = "Mở bằng Safari";

/* No comment provided by engineer. */
"Password" = "Mật khẩu";

/* No comment provided by engineer. */
"Please enter a name for the new attachment" = "Vui lòng nhập tên cho tệp đính kèm mới.";

/* No comment provided by engineer. */
"Polygon barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "Barrier dạng vùng (%1$@) có thuộc tính chi phí tỷ lệ là số âm hoặc bằng không (%2$@).";

/* No comment provided by engineer. */
"Polyline barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "Barrier dạng vùng (%1$@) có thuộc tính chi phí tỷ lệ là số âm hoặc bằng không (%2$@).";

/* No comment provided by engineer. */
"Polylines cannot be returned." = "Đa đường không thể quay trở lại.";

/* No comment provided by engineer. */
"Public Account user cannot access this application." = "Người dùng Tài khoản Công khai không thể truy cập ứng dụng này.";

/* No comment provided by engineer. */
"Remove Part" = "Gỡ bỏ Phần";

/* No comment provided by engineer. */
"Remove Vertex" = "Gỡ bỏ Vertex";

/* No comment provided by engineer. */
"Reordering stops (Traveling Salesman Problem) is not supported when the collection of stops contains waypoints or rest breaks." = "Chức năng sắp xếp lại các điểm dừng (Vấn đề với người bán hàng thường xuyên di chuyển) không được hỗ trợ khi tập hợp các điểm dừng có chứa tọa độ điểm hoặc điểm nghỉ chân.";

/* No comment provided by engineer. */
"Reset to Default Values" = "Thiết lập lại các Giá trị Mặc định";

/* No comment provided by engineer. */
"Retry" = "Thử lại";

/* No comment provided by engineer. */
"Route starts or ends on a waypoint." = "Tuyến đường bắt đầu hoặc kết thúc trên tọa độ điểm.";

/* No comment provided by engineer. */
"Save Image" = "Lưu Ảnh";

/* No comment provided by engineer. */
"Save Movie" = "Lưu phim";

/* No comment provided by engineer. */
"Sign In" = "Đăng nhập";

/* No comment provided by engineer. */
"Skip" = "Bỏ qua";

/* No comment provided by engineer. */
"Small" = "Nhỏ";

/* No comment provided by engineer. */
"Specified start time occurs before January 1, 1970." = "Thời gian bắt đầu đã chỉ định diễn ra trước ngày 1 tháng 1 năm 1970.";

/* No comment provided by engineer. */
"Stop (%1$@) has invalid added cost attribute names (%2$@)." = "Điểm dừng (%1$@) có tên thuộc tính chi phí được thêm vào không hợp lệ (%2$@).";

/* No comment provided by engineer. */
"Take Photo or Video" = "Chụp Ảnh hoặc quay Video";

/* No comment provided by engineer. */
"The default impedance cutoff is invalid." = "Ngưỡng trở kháng mặc định không hợp lệ.";

/* No comment provided by engineer. */
"The default target facility count is invalid." = "Số đếm cơ sở mục tiêu mặc định không hợp lệ.";

/* No comment provided by engineer. */
"The directions distance attribute name (%@) is invalid." = "Tên thuộc tính khoảng cách chỉ đường (%@) không hợp lệ.";

/* No comment provided by engineer. */
"The directions language is invalid." = "Ngôn ngữ chỉ đường không hợp lệ.";

/* No comment provided by engineer. */
"The directions road class attribute is invalid." = "Thuộc tính lớp đường của chỉ đường không hợp lệ.";

/* No comment provided by engineer. */
"The directions style is invalid." = "Kiểu chỉ đường không hợp lệ.";

/* No comment provided by engineer. */
"The directions time attribute name (%@) is invalid." = "Tên thuộc tính thời gian chỉ đường (%@) không hợp lệ.";

/* No comment provided by engineer. */
"The impedance attribute name (%@) is invalid." = "Tên thuộc tính trở kháng (%@) không hợp lệ.";

/* No comment provided by engineer. */
"The input spatial reference is undefined." = "Tham chiếu không gian đầu vào không được xác định.";

/* No comment provided by engineer. */
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Mạng không có thuộc tính phân cấp để thực hiện kế hoạch định tuyến phân cấp.";

/* No comment provided by engineer. */
"The object must first be saved to a portal using the 'saveAs:' method." = "Trước tiên đối tượng phải được lưu vào cổng thông tin bằng cách sử dụng phương pháp 'saveAs:'.";

/* No comment provided by engineer. */
"The output spatial reference is undefined." = "Tham chiếu không gian đầu ra không được xác định.";

/* No comment provided by engineer. */
"The polygon buffer distance is invalid." = "Khoảng cách vùng đệm dạng vùng không hợp lệ.";

/* No comment provided by engineer. */
"The resource you are looking for might have been removed, had its name changed, or is temporarily unavailable" = "Tài nguyên mà bạn đang tìm kiếm có thể đã bị xóa, đổi tên hoặc không khả dụng tạm thời";

/* No comment provided by engineer. */
"The resulting route has traversed one or more soft-restricted elements (%@)." = "Kết quả tuyến đường đã đi qua một hoặc nhiều yếu tố bị giới hạn (%@).";

/* No comment provided by engineer. */
"The route is too large to solve using the walking travel mode." = "Tuyến đường quá dài để tìm kiếm bằng hình thức đi bộ.";

/* No comment provided by engineer. */
"The search where clause is not supported." = "Tìm kiếm với từ khóa không được hỗ trợ.";

/* No comment provided by engineer. */
"The server’s certificate is invalid. You might be connecting to a server that is pretending to be '%@', which could put your confidential information at risk. Would you like to connect anyway?" = "Chứng chỉ của máy chủ không hợp lệ. Bạn có thể kết nối với một máy chủ như '%@' có thể đưa thông tin mật của bạn vào rủi ro. Bạn có vẫn muốn kết nối không?";

/* No comment provided by engineer. */
"The service cannot properly calculate time shift." = "Dịch vụ không thể tính toán đúng ca thời gian.";

/* No comment provided by engineer. */
"The specified clientID is invalid" = "ID khách hàng đã chỉ định không hợp lệ";

/* No comment provided by engineer. */
"The stop type property was ignored for stops (%@) because the server does not support selected type of stop." = "Thuộc tính loại điểm dừng được bỏ qua cho các điểm dừng (%@) vì máy chủ không hỗ trợ loại điểm dừng được chọn.";

/* No comment provided by engineer. */
"The travel mode has been set to default." = "Hình thức đi lại đã được thiết lập về mặc định.";

/* No comment provided by engineer. */
"The waypoints (%@) contain added cost attribute." = "Các tọa độ điểm (%@) có thuộc tính chi phí được bổ sung.";

/* No comment provided by engineer. */
"The waypoints (%@) contain time windows." = "Các tọa độ điểm (%@) có các khung giờ.";

/* No comment provided by engineer. */
"There was an error loading the feature. Please check your network connectivity." = "Xảy ra lỗi tải đối tượng. Vui lòng kiểm tra kết nối mạng của bạn.";

/* No comment provided by engineer. */
"Time windows start date was changed." = "Ngày bắt đầu khung giờ được thay đổi.";

/* No comment provided by engineer. */
"Time windows were ignored because the impedance attribute is not time based." = "Các khung giờ được bỏ qua vì thuộc tính trở kháng không dựa trên thời gian.";

/* No comment provided by engineer. */
"To save as a new item, you must be logged in to the portal." = "Để lưu như một mục mới, bạn phải đăng nhập vào cổng thông tin.";

/* No comment provided by engineer. */
"Today" = "Hôm nay";

/* No comment provided by engineer. */
"Token is invalid or has expired" = "Mã thông báo không hợp lệ hoặc đã hết hạn";

/* No comment provided by engineer. */
"Token URL is nil. You must set a valid token URL on the credential." = "URL Token là không. Bạn phải thiết lập một URL Token hợp lệ trên thông tin đăng nhập.";

/* No comment provided by engineer. */
"Unable to login with provided credentials." = "Không thể đăng nhập bằng thông tin được cung cấp.";

/* No comment provided by engineer. */
"Unable to retrieve user profile from the provider" = "Không thể truy xuất hồ sơ người dùng từ nhà cung cấp";

/* No comment provided by engineer. */
"Unauthorized access" = "Truy cập trái phép";

/* No comment provided by engineer. */
"Unknown authentication error" = "Lỗi xác thực không xác định";

/* No comment provided by engineer. */
"Unknown condition." = "Trạng thái không xác định";

/* No comment provided by engineer. */
"Unknown error occurred" = "Đã xảy ra lỗi không xác định";

/* No comment provided by engineer. */
"Unsupported GPX data." = "Dữ liệu GPX không được hỗ trợ.";

/* No comment provided by engineer. */
"User canceled error" = "Lỗi do người sử dụng hủy";

/* No comment provided by engineer. */
"User licenses assigned by your organization are invalid. Please contact your administrator to adjust the license assignments and try again." = "Giấy phép người dùng do tổ chức của bạn cấp không hợp lệ. Hãy liên lạc với quản trị viên của bạn để điều chỉnh việc cấp giấy phép và thử lại.";

/* No comment provided by engineer. */
"Username" = "Tên đăng nhập";

/* No comment provided by engineer. */
"Using browser to authenticate..." = "Sử dụng trình duyệt để xác thực...";

/* No comment provided by engineer. */
"Value exceeds maximum field length of %lu" = "Giá trị vượt quá độ dài trường tối đa là %lu";

/* No comment provided by engineer. */
"You are changing the feature type. Would you like to keep your current values (where possible) or reset to defaults?" = "Bạn đang thay đổi loại đối tượng. Bạn có muốn giữ các giá trị hiện tại (khi có thể) hoặc thiết lập lại mặc định hay không?";

/* No comment provided by engineer. */
"You cannot sign in because you do not have an organization account associated with your social network credentials" = "Bạn không thể đăng nhập do không có tài khoản tổ chức liên quan đến thông tin xác thực trên mạng xã hội của bạn.";

/* No comment provided by engineer. */
"You do not have permissions to access this resource" = "Bạn không có quyền truy cập vào tài nguyên này";

/* No comment provided by engineer. */
"You do not have sufficient user level to access this application." = "Bạn chưa đạt đến cấp độ người dùng để truy cập vào ứng dụng này.";

/* No comment provided by engineer. */
"You must be logged in to the Portal to perform this operation." = "Bạn phải đăng nhập vào Cổng thông tin để thực hiện thao tác này.";

/* No comment provided by engineer. */
"You must be specify a rating between 1 and 5." = "Bạn phải xác định một xếp loại trong khoảng từ 1 đến 5.";

/* No comment provided by engineer. */
"You must specify a location usage description key (NSLocationWhenInUseUsageDescription or NSLocationAlwaysUsageDescription) in your plist." = "Bạn phải xác định một khóa mô tả sử dụng vị trí (NSLocationWhenInUseUsageDescription hoặc NSLocationAlwaysUsageDescription) trong plist của bạn.";

/* No comment provided by engineer. */
"You need to select a certificate to access the resource '%@'" = "Bạn cần chọn một chứng chỉ để truy cập tài nguyên '%@'";

/* No comment provided by engineer. */
"You need to sign in to access the resource '%@'" = "Bạn cần đăng nhập vào để truy cập tài nguyên '%@'";

/* No comment provided by engineer. */
"• " = "• ";

﻿/* Localizable+Additions.strings */

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Không xác định";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Xentimét";
"Decimal Degrees" = "Độ thập phân";
"Decimeters" = "Đềximét";
"Feet" = "Bộ";
"Inches" = "Inch";
"Kilometers" = "Kilômét";
"Meters" = "Mét";
"Miles" = "Dặm";
"Millimeters" = "Milimét";
"Nautical Miles" = "Hải lý";
"Points" = "Điểm";
"Yards" = "Thước";

/* Area Units Abbreviated Strings */
"sq. in" = "in2";
"sq. ft" = "ft2";
"sq. yd" = "yd2";
"ac" = "ac";
"sq. mi" = "mi2";
"sq. mm" = "mm2";
"sq. cm" = "cm2";
"sq. dm" = "dm2";
"sq. m" = "m2";
"ares" = "are";
"ha" = "ha";
"sq. km" = "km2";

/* Area Units Display Strings */
"Square Inches" = "Inch Vuông";
"Square Feet" = "Bộ vuông";
"Square Yards" = "Thước Vuông";
"Acres" = "Acre";
"Square Miles" = "Dặm vuông";
"Square Millimeters" = "Millimét Vuông";
"Square Centimeters" = "Xentimét Vuông";
"Square Decimeters" = "Đềximét Vuông";
"Square Meters" = "Mét vuông";
"Ares" = "Are";
"Hectares" = "Hecta";
"Square Kilometers" = "Kilômét vuông";

